{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Acute COPD exacerbation / infection",
    "1": "Acute dystonic reactions",
    "2": "Acute laryngitis",
    "3": "Acute otitis media",
    "4": "Acute pulmonary edema",
    "5": "Acute rhinosinusitis",
    "6": "Allergic sinusitis",
    "7": "Anaphylaxis",
    "8": "Anemia",
    "9": "Atrial fibrillation",
    "10": "Boerhaave",
    "11": "Bronchiectasis",
    "12": "Bronchiolitis",
    "13": "Bronchitis",
    "14": "Bronchospasm / acute asthma exacerbation",
    "15": "Chagas",
    "16": "Chronic rhinosinusitis",
    "17": "Cluster headache",
    "18": "Croup",
    "19": "Ebola",
    "20": "Epiglottitis",
    "21": "GERD",
    "22": "Guillain-Barr\u00e9 syndrome",
    "23": "HIV (initial infection)",
    "24": "Influenza",
    "25": "Inguinal hernia",
    "26": "Larygospasm",
    "27": "Localized edema",
    "28": "Myasthenia gravis",
    "29": "Myocarditis",
    "30": "PSVT",
    "31": "Pancreatic neoplasm",
    "32": "Panic attack",
    "33": "Pericarditis",
    "34": "Pneumonia",
    "35": "Possible NSTEMI / STEMI",
    "36": "Pulmonary embolism",
    "37": "Pulmonary neoplasm",
    "38": "SLE",
    "39": "Sarcoidosis",
    "40": "Scombroid food poisoning",
    "41": "Spontaneous pneumothorax",
    "42": "Spontaneous rib fracture",
    "43": "Stable angina",
    "44": "Tuberculosis",
    "45": "URTI",
    "46": "Unstable angina",
    "47": "Viral pharyngitis",
    "48": "Whooping cough"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acute COPD exacerbation / infection": 0,
    "Acute dystonic reactions": 1,
    "Acute laryngitis": 2,
    "Acute otitis media": 3,
    "Acute pulmonary edema": 4,
    "Acute rhinosinusitis": 5,
    "Allergic sinusitis": 6,
    "Anaphylaxis": 7,
    "Anemia": 8,
    "Atrial fibrillation": 9,
    "Boerhaave": 10,
    "Bronchiectasis": 11,
    "Bronchiolitis": 12,
    "Bronchitis": 13,
    "Bronchospasm / acute asthma exacerbation": 14,
    "Chagas": 15,
    "Chronic rhinosinusitis": 16,
    "Cluster headache": 17,
    "Croup": 18,
    "Ebola": 19,
    "Epiglottitis": 20,
    "GERD": 21,
    "Guillain-Barr\u00e9 syndrome": 22,
    "HIV (initial infection)": 23,
    "Influenza": 24,
    "Inguinal hernia": 25,
    "Larygospasm": 26,
    "Localized edema": 27,
    "Myasthenia gravis": 28,
    "Myocarditis": 29,
    "PSVT": 30,
    "Pancreatic neoplasm": 31,
    "Panic attack": 32,
    "Pericarditis": 33,
    "Pneumonia": 34,
    "Possible NSTEMI / STEMI": 35,
    "Pulmonary embolism": 36,
    "Pulmonary neoplasm": 37,
    "SLE": 38,
    "Sarcoidosis": 39,
    "Scombroid food poisoning": 40,
    "Spontaneous pneumothorax": 41,
    "Spontaneous rib fracture": 42,
    "Stable angina": 43,
    "Tuberculosis": 44,
    "URTI": 45,
    "Unstable angina": 46,
    "Viral pharyngitis": 47,
    "Whooping cough": 48
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
